Autodesk.Revit.DB.TriangulationInterfaceForTriangulatedShellComponent.#ctor(Autodesk.Revit.DB.TriangulatedShellComponent)
Constructs an interface object for a TriangulatedShellComponent.
externalTriangulatedShellComponent:
The TriangulatedShellComponent that the interface object represents.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.TriangulationInterfaceForTriangulatedShellComponent
This class is used to call FacetingUtils::convertTrianglesToQuads with a triangulation defined
by a TriangulatedShellComponent.
Remarks:
Compare to TriangulationInterfaceForTriangulatedSolidOrShell, which treats with the entire solid or shell as
a single triangulated structure.
Since:
2013